package HW1;

public class hw1task2 {
    public static void main(String[] args) {
        /*Coздать две переменные типа int:
        int a = 7;
        int b = 9;
        Поменять между собой значения переменных a и b.
        Создавать новые переменные нельзя.
        Можно применять только арифметические действия к перемнным a и b.
        Вывести в консоль значения переменных a и b после их переопределения.*/

        int a = 7;
        int b = 9;

        a+=2;
        b-=2;

        System.out.println("a = " + a);
        System.out.println("b = " + b);





    }


}
